# Project Title
### Data Engineering Capstone Project

#### Project Summary
--describe your project at a high level--

The project follows the follow steps:
* Step 1: Scope the Project and Gather Data
* Step 2: Explore and Assess the Data
* Step 3: Define the Data Model
* Step 4: Run ETL to Model the Data
* Step 5: Complete Project Write Up

In [5]:
# Do all imports and installs here
import pandas as pd
from pyspark.sql import SparkSession
from pyspark import SparkConf
from typing import Dict, List
from pyspark.sql import Window
from pyspark.sql import functions as F
from pyspark.sql.dataframe import DataFrame
from pyspark.sql.types import DateType, StringType, FloatType, ByteType, IntegerType, DecimalType
import os

In [6]:
!pip install utils

Requirement already satisfied: utils in /opt/conda/lib/python3.6/site-packages (1.0.1)

In [7]:
import utils

### Step 1: Scope the Project and Gather Data

#### Scope 
Explain what you plan to do in the project in more detail. What data do you use? What is your end solution look like? What tools did you use? etc>

#### Describe and Gather Data 
Describe the data sets you're using. Where did it come from? What type of information is included?

In [8]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.\
config("spark.jars.repositories", "https://repos.spark-packages.org/").\
config("spark.jars.packages", "saurfang:spark-sas7bdat:2.0.0-s_2.11").\
enableHiveSupport().getOrCreate()

# analysing global temparature city file

In [9]:
input_dir = "/workspace/home"
output_dir = "/workspace/home/output"

In [11]:
temperature_df = spark.read.option("header", True).csv("GlobalLandTemperaturesByCity.csv")
print("Number of rows: ", temperature_df.count())
temperature_df.limit(5).toPandas()

Number of rows:  600311

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.7369999999999999,Århus,Denmark,57.05N,10.33E
1,1743-12-01,None,None,Århus,Denmark,57.05N,10.33E
2,1744-01-01,None,None,Århus,Denmark,57.05N,10.33E
3,1744-02-01,None,None,Århus,Denmark,57.05N,10.33E
4,1744-03-01,None,None,Århus,Denmark,57.05N,10.33E

In [25]:
def globalcity_temperature_process(spark, input_dir, output_dir):

    """Create/Recreate globalcity_temperature_process dimension table."""
    table_name = "globalcity_temperature_process"
    csv_path= os.path.join(input_dir, "GlobalLandTemperaturesByCity.csv")
    temp_df = spark.read.option("header", True).csv(csv_path)
    print("Before process -----------")
    print(temp_df.show())
    temp_df = temp_df.dropna()
    temp_df = temp_df.withColumn("year", F.year("dt")).withColumn("month", F.month("dt"))
    temp_df = temp_df.groupBy([F.col("Country").alias("country"), "year", "month"]).agg(
        F.avg("AverageTemperature").alias("average_temperature"),
        F.avg("AverageTemperatureUncertainty").alias("average_temperature_uncertainty"),
    )
    temp_df = temp_df.withColumn("temperature_id", F.monotonically_increasing_id())

    #check_data_quality(temp_df, "temperature_id", table_name)
    output_path = os.path.join(output_dir, table_name)
    print(f"Data for {table_name} table was successfully processed.")
    temp_df.write.mode("overwrite").parquet(output_path)
    temp_df.show()
    return temp_df
temp_df=globalcity_temperature_process(spark, input_dir, output_dir)

Before process -----------
+----------+-------------------+-----------------------------+-----+-------+--------+---------+
|        dt| AverageTemperature|AverageTemperatureUncertainty| City|Country|Latitude|Longitude|
+----------+-------------------+-----------------------------+-----+-------+--------+---------+
|1743-11-01|              6.068|           1.7369999999999999|Århus|Denmark|  57.05N|   10.33E|
|1743-12-01|               null|                         null|Århus|Denmark|  57.05N|   10.33E|
|1744-01-01|               null|                         null|Århus|Denmark|  57.05N|   10.33E|
|1744-02-01|               null|                         null|Århus|Denmark|  57.05N|   10.33E|
|1744-03-01|               null|                         null|Århus|Denmark|  57.05N|   10.33E|
|1744-04-01| 5.7879999999999985|           3.6239999999999997|Århus|Denmark|  57.05N|   10.33E|
|1744-05-01|             10.644|           1.2830000000000001|Århus|Denmark|  57.05N|   10.33E|
|1744-06-01| 14.050999999999998|                        1.347|Århus|Denmark|  57.05N|   10.33E|
|1744-07-01|             16.082|                        1.396|Århus|Denmark|  57.05N|   10.33E|
|1744-08-01|               null|                         null|Århus|Denmark|  57.05N|   10.33E|
|1744-09-01| 12.780999999999999|                        1.454|Århus|Denmark|  57.05N|   10.33E|
|1744-10-01|               7.95|                         1.63|Århus|Denmark|  57.05N|   10.33E|
|1744-11-01|  4.638999999999999|           1.3019999999999998|Århus|Denmark|  57.05N|   10.33E|
|1744-12-01|0.12199999999999987|                        1.756|Århus|Denmark|  57.05N|   10.33E|
|1745-01-01|-1.3330000000000002|                        1.642|Århus|Denmark|  57.05N|   10.33E|
|1745-02-01|             -2.732|                        1.358|Århus|Denmark|  57.05N|   10.33E|
|1745-03-01|              0.129|                        1.088|Århus|Denmark|  57.05N|   10.33E|
|1745-04-01|              4.042|                        1.138|Århus|Denmark|  57.05N|   10.33E|
|1745-05-01|               null|                         null|Århus|Denmark|  57.05N|   10.33E|
|1745-06-01|               null|                         null|Århus|Denmark|  57.05N|   10.33E|
+----------+-------------------+-----------------------------+-----+-------+--------+---------+
only showing top 20 rows

None
Data for globalcity_temperature_process table was successfully processed.
+-------+----+-----+-------------------+-------------------------------+--------------+
|country|year|month|average_temperature|average_temperature_uncertainty|temperature_id|
+-------+----+-----+-------------------+-------------------------------+--------------+
|Denmark|1760|   11|              3.447|                          3.927|             0|
|Denmark|1765|    3|               3.12|             3.2089999999999996|             1|
|Denmark|1800|    6|             12.283|             2.1180000000000003|             2|
|Denmark|1820|    4|              6.789|             1.4669999999999999|             3|
|Denmark|1832|    4|              6.936|                          3.908|             4|
|Denmark|1873|    8|             16.046|                          0.305|             5|
|Denmark|1897|    9| 12.482000000000001|                          0.405|             6|
|Denmark|1947|    2| -7.816000000000002|                          0.531|             7|
|Denmark|1992|    1|              3.148|                          0.342|             8|
|Denmark|1996|    1|              -1.88|                          0.243|             9|
| Turkey|1774|    8|             22.574|                         2.3622|            10|
| Turkey|1782|    7| 22.916571428571427|              4.101428571428571|            11|
| Turkey|1783|   10| 12.931285714285716|             3.3281428571428573|            12|
| Turkey|1801|    7| 24.208555555555556|             2.2268888888888885|            13|
| Turkey|1810|    7|  21.80966666666667|              2.493444444444444|            14|
| Turkey|1810|    9| 18.541111111111107|             1.9055555555555554|            15|
| Turkey|1821|    6| 17.743555555555556|              4.441999999999999|            16|
| Turkey|1842|   10| 14.789111111111112|             1.6881111111111111|            17|
| Turkey|1851|    9|  19.98711111111111|             0.9846666666666667|            18|
| Turkey|1856|   10| 14.013222222222222|             1.2553333333333332|            19|
+-------+----+-----+-------------------+-------------------------------+--------------+
only showing top 20 rows

# Analysing U.s demographic cities

In [5]:
def process_demographic(spark: SparkSession, input_dir_path: str, output_dir_path: str) -> None:
    """Create/Recreate demographic dimension table."""
    table_name = "demographic"

    #demog_df = read_demographic_csv(spark, input_dir_path)
    #csv_path = get_file_path(dir_path, "us-cities-demographics.csv")
    #spark_df = spark.read.option("header", True).options(delimiter=";").csv(csv_path)
    csv_path= os.path.join(input_dir, "us-cities-demographics.csv")
    #demog_df = spark.read.option("header", True).csv(csv_path)
    demog_df = spark.read.option("header", True).options(delimiter=";").csv(csv_path)
    print("Before processing -----------------------------")
    demog_df.show()
    demog_df = demog_df.groupBy(F.col("State Code").alias("state_code")).agg(
        F.sum("Total Population").cast(IntegerType()).alias("total_population"),
        F.sum("Male Population").cast(IntegerType()).alias("male_population"),
        F.sum("Female Population").cast(IntegerType()).alias("female_population"),
        F.sum("Number of Veterans").cast(IntegerType()).alias("number_of_veterans"),
        F.sum("Foreign-born").cast(IntegerType()).alias("foregin_born"),
        F.avg("Median Age").cast(FloatType()).alias("median_age"),
        F.avg("Average Household Size").cast(FloatType()).alias("average_household_size"),
    )

    #check_data_quality(demog_df, "state_code", table_name)
    print(f"Data for {table_name} table was successfully processed.")
    #demog_df.limit(5).toPandas()
    #output_path = os.path.join(output_dir, table_name)
    print(f"Data for {table_name} table was successfully processed.")
    #demog_df.write.mode("overwrite").parquet(output_path)
    #demog_df.show()
    return demog_df
demog_df=process_demographic(spark, input_dir, output_dir)
    #write_table_data(demog_df, output_dir_path, table_name)

Before processing -----------------------------
+----------------+--------------+----------+---------------+-----------------+----------------+------------------+------------+----------------------+----------+--------------------+------+
|            City|         State|Median Age|Male Population|Female Population|Total Population|Number of Veterans|Foreign-born|Average Household Size|State Code|                Race| Count|
+----------------+--------------+----------+---------------+-----------------+----------------+------------------+------------+----------------------+----------+--------------------+------+
|   Silver Spring|      Maryland|      33.8|          40601|            41862|           82463|              1562|       30908|                   2.6|        MD|  Hispanic or Latino| 25924|
|          Quincy| Massachusetts|      41.0|          44129|            49500|           93629|              4147|       32935|                  2.39|        MA|               White| 58723|
|          Hoover|       Alabama|      38.5|          38040|            46799|           84839|              4819|        8229|                  2.58|        AL|               Asian|  4759|
|Rancho Cucamonga|    California|      34.5|          88127|            87105|          175232|              5821|       33878|                  3.18|        CA|Black or African-...| 24437|
|          Newark|    New Jersey|      34.6|         138040|           143873|          281913|              5829|       86253|                  2.73|        NJ|               White| 76402|
|          Peoria|      Illinois|      33.1|          56229|            62432|          118661|              6634|        7517|                   2.4|        IL|American Indian a...|  1343|
|        Avondale|       Arizona|      29.1|          38712|            41971|           80683|              4815|        8355|                  3.18|        AZ|Black or African-...| 11592|
|     West Covina|    California|      39.8|          51629|            56860|          108489|              3800|       37038|                  3.56|        CA|               Asian| 32716|
|        O'Fallon|      Missouri|      36.0|          41762|            43270|           85032|              5783|        3269|                  2.77|        MO|  Hispanic or Latino|  2583|
|      High Point|North Carolina|      35.5|          51751|            58077|          109828|              5204|       16315|                  2.65|        NC|               Asian| 11060|
|          Folsom|    California|      40.9|          41051|            35317|           76368|              4187|       13234|                  2.62|        CA|  Hispanic or Latino|  5822|
|          Folsom|    California|      40.9|          41051|            35317|           76368|              4187|       13234|                  2.62|        CA|American Indian a...|   998|
|    Philadelphia|  Pennsylvania|      34.1|         741270|           826172|         1567442|             61995|      205339|                  2.61|        PA|               Asian|122721|
|         Wichita|        Kansas|      34.6|         192354|           197601|          389955|             23978|       40270|                  2.56|        KS|  Hispanic or Latino| 65162|
|         Wichita|        Kansas|      34.6|         192354|           197601|          389955|             23978|       40270|                  2.56|        KS|American Indian a...|  8791|
|      Fort Myers|       Florida|      37.3|          36850|            37165|           74015|              4312|       15365|                  2.45|        FL|               White| 50169|
|      Pittsburgh|  Pennsylvania|      32.9|         149690|           154695|          304385|             17728|       28187|                  2.13|        PA|               White|208863|
|          Laredo|         Texas|      28.8|         124305|           131484|          255789|              4921|       68427|                  3.66|        TX|American Indian a...|  1253|
|        Berkeley|    California|      32.5|          60142|            60829|          120971|              3736|       25000|                  2.35|        CA|               Asian| 27089|
|     Santa Clara|    California|      35.2|          63278|            62938|          126216|              4426|       52281|                  2.75|        CA|               White| 55847|
+----------------+--------------+----------+---------------+-----------------+----------------+------------------+------------+----------------------+----------+--------------------+------+
only showing top 20 rows

Data for demographic table was successfully processed.
Data for demographic table was successfully processed.

In [13]:
demographic_df = spark.read \
    .option("header", True) \
    .options(delimiter=';') \
    .csv("us-cities-demographics.csv")

print("Number of rows: ", demographic_df.count())

print("Minimum population: ", demographic_df.select(F.col("Total Population").cast(IntegerType())).sort(F.col("Total Population").asc()).limit(1).toPandas().iloc[0])
print("Maximum population: ", demographic_df.select(F.col("Total Population").cast(IntegerType())).sort(F.col("Total Population").desc()).limit(1).toPandas().iloc[0])

demographic_df.limit(5).toPandas()

Number of rows:  2891
Minimum population:  Total Population    63215
Name: 0, dtype: int32
Maximum population:  Total Population    8550405
Name: 0, dtype: int32

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601,41862,82463,1562,30908,2.6,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129,49500,93629,4147,32935,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040,46799,84839,4819,8229,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127,87105,175232,5821,33878,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040,143873,281913,5829,86253,2.73,NJ,White,76402

## Anlysing Immigration data

In [14]:
immigration_df = spark.read.csv('immigration_data_sample.csv',header=True)

In [7]:
immigration_df.printSchema()

root
 |-- _c0: string (nullable = true)
 |-- cicid: string (nullable = true)
 |-- i94yr: string (nullable = true)
 |-- i94mon: string (nullable = true)
 |-- i94cit: string (nullable = true)
 |-- i94res: string (nullable = true)
 |-- i94port: string (nullable = true)
 |-- arrdate: string (nullable = true)
 |-- i94mode: string (nullable = true)
 |-- i94addr: string (nullable = true)
 |-- depdate: string (nullable = true)
 |-- i94bir: string (nullable = true)
 |-- i94visa: string (nullable = true)
 |-- count: string (nullable = true)
 |-- dtadfile: string (nullable = true)
 |-- visapost: string (nullable = true)
 |-- occup: string (nullable = true)
 |-- entdepa: string (nullable = true)
 |-- entdepd: string (nullable = true)
 |-- entdepu: string (nullable = true)
 |-- matflag: string (nullable = true)
 |-- biryear: string (nullable = true)
 |-- dtaddto: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- insnum: string (nullable = true)
 |-- airline: string (nullable = true)
 |-- admnum: string (nullable = true)
 |-- fltno: string (nullable = true)
 |-- visatype: string (nullable = true)

In [8]:
immigration_df.show(truncate=False)

+-------+---------+------+------+------+------+-------+-------+-------+-------+-------+------+-------+-----+--------+--------+-----+-------+-------+-------+-------+-------+--------+------+------+-------+-------------+-----+--------+
|_c0    |cicid    |i94yr |i94mon|i94cit|i94res|i94port|arrdate|i94mode|i94addr|depdate|i94bir|i94visa|count|dtadfile|visapost|occup|entdepa|entdepd|entdepu|matflag|biryear|dtaddto |gender|insnum|airline|admnum       |fltno|visatype|
+-------+---------+------+------+------+------+-------+-------+-------+-------+-------+------+-------+-----+--------+--------+-----+-------+-------+-------+-------+-------+--------+------+------+-------+-------------+-----+--------+
|2027561|4084316.0|2016.0|4.0   |209.0 |209.0 |HHW    |20566.0|1.0    |HI     |20573.0|61.0  |2.0    |1.0  |20160422|null    |null |G      |O      |null   |M      |1955.0 |07202016|F     |null  |JL     |56582674633.0|00782|WT      |
|2171295|4422636.0|2016.0|4.0   |582.0 |582.0 |MCA    |20567.0|1.0    |TX     |20568.0|26.0  |2.0    |1.0  |20160423|MTR     |null |G      |R      |null   |M      |1990.0 |10222016|M     |null  |*GA    |94361995930.0|XBLNG|B2      |
|589494 |1195600.0|2016.0|4.0   |148.0 |112.0 |OGG    |20551.0|1.0    |FL     |20571.0|76.0  |2.0    |1.0  |20160407|null    |null |G      |O      |null   |M      |1940.0 |07052016|M     |null  |LH     |55780468433.0|00464|WT      |
|2631158|5291768.0|2016.0|4.0   |297.0 |297.0 |LOS    |20572.0|1.0    |CA     |20581.0|25.0  |2.0    |1.0  |20160428|DOH     |null |G      |O      |null   |M      |1991.0 |10272016|M     |null  |QR     |94789696030.0|00739|B2      |
|3032257|985523.0 |2016.0|4.0   |111.0 |111.0 |CHM    |20550.0|3.0    |NY     |20553.0|19.0  |2.0    |1.0  |20160406|null    |null |Z      |K      |null   |M      |1997.0 |07042016|F     |null  |null   |42322572633.0|LAND |WT      |
|721257 |1481650.0|2016.0|4.0   |577.0 |577.0 |ATL    |20552.0|1.0    |GA     |20606.0|51.0  |2.0    |1.0  |20160408|null    |null |T      |N      |null   |M      |1965.0 |10072016|M     |null  |DL     |736852585.0  |910  |B2      |
|1072780|2197173.0|2016.0|4.0   |245.0 |245.0 |SFR    |20556.0|1.0    |CA     |20635.0|48.0  |2.0    |1.0  |20160412|null    |null |T      |O      |null   |M      |1968.0 |10112016|F     |null  |CX     |786312185.0  |870  |B2      |
|112205 |232708.0 |2016.0|4.0   |113.0 |135.0 |NYC    |20546.0|1.0    |NY     |20554.0|33.0  |2.0    |1.0  |20160402|null    |null |G      |O      |null   |M      |1983.0 |06302016|F     |null  |BA     |55474485033.0|00117|WT      |
|2577162|5227851.0|2016.0|4.0   |131.0 |131.0 |CHI    |20572.0|1.0    |IL     |20575.0|39.0  |2.0    |1.0  |20160428|null    |null |O      |O      |null   |M      |1977.0 |07262016|null  |null  |LX     |59413424733.0|00008|WT      |
|10930  |13213.0  |2016.0|4.0   |116.0 |116.0 |LOS    |20545.0|1.0    |CA     |20553.0|35.0  |2.0    |1.0  |20160401|null    |null |O      |O      |null   |M      |1981.0 |06292016|null  |null  |AA     |55449792933.0|00109|WT      |
|617174 |1230572.0|2016.0|4.0   |438.0 |438.0 |LOS    |20551.0|1.0    |CA     |20565.0|4.0   |2.0    |1.0  |20160407|null    |null |G      |O      |null   |M      |2012.0 |07052016|F     |null  |QF     |55743814633.0|00015|WT      |
|2497156|5056736.0|2016.0|4.0   |209.0 |209.0 |PHI    |20571.0|1.0    |HI     |20575.0|72.0  |2.0    |1.0  |20160427|null    |null |G      |O      |null   |M      |1944.0 |07252016|M     |null  |DL     |59336618033.0|00598|WT      |
|1339656|2711583.0|2016.0|4.0   |148.0 |112.0 |FTL    |20559.0|2.0    |null   |20565.0|54.0  |2.0    |1.0  |20160415|null    |null |G      |O      |null   |M      |1962.0 |07132016|F     |null  |VES    |56175860733.0|93724|WT      |
|2430322|4916639.0|2016.0|4.0   |260.0 |260.0 |LOS    |20570.0|1.0    |CA     |20581.0|62.0  |2.0    |1.0  |20160426|MNL     |null |G      |O      |null   |M      |1954.0 |10252016|F     |null  |EK     |94612771030.0|00215|B2      |
|682005 |1387607.0|2016.0|4.0   |148.0 |112.0 |BOS    |20552.0|1.0    |MA     |20560.0|34.0  |2.0    |1.0  |20160408|null    |null |G      |K      |null   |M      |1982.0 |07062016|F     |null  |AF     |55833387633.0|00338|WT      |
|2938436|5960799.0|2016.0|4.0   |245.0 |245.0 |SAI    |20545.0|1.0    |null   |20550.0|30.0  |2.0    |1.0  |20160615|null    |null |P      |D      |null   |M      |1986.0 |04132016|M     |3882  |MU     |44162582033.0|00763|CP      |
|530804 |1056530.0|2016.0|4.0   |512.0 |512.0 |NAS    |20550.0|1.0    |GA     |20552.0|21.0  |2.0    |1.0  |20160406|NSS     |null |G      |O      |null   |M      |1995.0 |10052016|F     |null  |DL     |92858001630.0|00554|B2      |
|1187149|2466971.0|2016.0|4.0   |689.0 |689.0 |FTL    |20557.0|1.0    |FL     |20569.0|43.0  |2.0    |1.0  |20160413|null    |null |O      |O      |null   |M      |1973.0 |10122016|null  |null  |AD     |93384901630.0|08704|B2      |
|2283033|4668286.0|2016.0|4.0   |746.0 |158.0 |SEA    |20568.0|1.0    |NV     |20571.0|46.0  |2.0    |1.0  |20160424|MOS     |null |G      |O      |null   |M      |1970.0 |10232016|M     |null  |DL     |94435600530.0|00143|B2      |
|1262082|2556646.0|2016.0|4.0   |260.0 |260.0 |FTL    |20558.0|1.0    |CA     |20596.0|14.0  |2.0    |1.0  |20160414|MNL     |null |G      |O      |null   |M      |2002.0 |10132016|M     |null  |OZ     |93536845530.0|00204|B2      |
+-------+---------+------+------+------+------+-------+-------+-------+-------+-------+------+-------+-----+--------+--------+-----+-------+-------+-------+-------+-------+--------+------+------+-------+-------------+-----+--------+
only showing top 20 rows

In [7]:
immigration_df.count()

1000

In [8]:
immigration_df.dropDuplicates().count()

1000

In [9]:
immigration_df.describe().show(truncate=False)

+-------+-----------------+------------------+------+------+------------------+------------------+-------+-----------------+------------------+-------+------------------+-----------------+------------------+-----+-----------------+--------+-----+-------+-------+-------+-------+-----------------+------------------+------+------------------+-------+--------------------+------------------+--------+
|summary|_c0              |cicid             |i94yr |i94mon|i94cit            |i94res            |i94port|arrdate          |i94mode           |i94addr|depdate           |i94bir           |i94visa           |count|dtadfile         |visapost|occup|entdepa|entdepd|entdepu|matflag|biryear          |dtaddto           |gender|insnum            |airline|admnum              |fltno             |visatype|
+-------+-----------------+------------------+------+------+------------------+------------------+-------+-----------------+------------------+-------+------------------+-----------------+------------------+-----+-----------------+--------+-----+-------+-------+-------+-------+-----------------+------------------+------+------------------+-------+--------------------+------------------+--------+
|count  |1000             |1000              |1000  |1000  |1000              |1000              |1000   |1000             |1000              |941    |951               |1000             |1000              |1000 |1000             |382     |4    |1000   |954    |0      |954    |1000             |1000              |859   |35                |967    |1000                |992               |1000    |
|mean   |1542097.12       |3040461.409       |2016.0|4.0   |302.928           |298.262           |null   |20559.68         |1.078             |null   |20575.03785488959 |42.382           |1.859             |1.0  |2.0160424879E7   |null    |null |null   |null   |null   |null   |1973.618         |8258277.404255319 |null  |3826.8571428571427|2.0    |6.9372367950789E10  |1337.2554291623578|null    |
|stddev |915287.9043923795|1799817.7827726966|0.0   |0.0   |206.48528516334758|202.12038988683958|null   |8.995026987758733|0.4859548869516101|null   |24.211233522000143|17.90342449389526|0.3863525181337226|0.0  |49.51656540286629|null    |null |null   |null   |null   |null   |17.90342449389525|1622586.3557888167|null  |221.7425829858661 |0.0    |2.338134181802248E10|6149.954574383991 |null    |
|min    |1006205          |1000074.0         |2016.0|4.0   |103.0             |103.0             |AGA    |20545.0          |1.0               |AL     |20547.0           |1.0              |1.0               |1.0  |20160401         |ABD     |OTH  |A      |D      |null   |M      |1923.0           |04082018          |F     |3468              |*GA    |0.0                 |00001             |B1      |
|max    |997880           |999282.0          |2016.0|4.0   |746.0             |696.0             |X96    |20574.0          |9.0               |WI     |20715.0           |93.0             |3.0               |1.0  |20160801         |WRW     |STU  |Z      |W      |null   |M      |2015.0           |D/S               |X     |4686              |ZX     |95021509030.0       |XBLNG             |WT      |
+-------+-----------------+------------------+------+------+------------------+------------------+-------+-----------------+------------------+-------+------------------+-----------------+------------------+-----+-----------------+--------+-----+-------+-------+-------+-------+-----------------+------------------+------+------------------+-------+--------------------+------------------+--------+

## Analysing airpots codes

In [15]:
# Read in the data here
airport_df = spark.read \
    .option("header", True) \
    .csv("airport-codes_csv.csv")

In [16]:
print(airport_df.count())
airport_df.limit(5).toPandas()

55075

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
0,00A,heliport,Total Rf Heliport,11,NA,US,US-PA,Bensalem,00A,None,00A,"-74.93360137939453, 40.07080078125"
1,00AA,small_airport,Aero B Ranch Airport,3435,NA,US,US-KS,Leoti,00AA,None,00AA,"-101.473911, 38.704022"
2,00AK,small_airport,Lowell Field,450,NA,US,US-AK,Anchor Point,00AK,None,00AK,"-151.695999146, 59.94919968"
3,00AL,small_airport,Epps Airpark,820,NA,US,US-AL,Harvest,00AL,None,00AL,"-86.77030181884766, 34.86479949951172"
4,00AR,closed,Newport Hospital & Clinic Heliport,237,NA,US,US-AR,Newport,None,None,None,"-91.254898, 35.6087"

In [12]:
airport_df.dropDuplicates().count()

55075

## I94 Immigration Data

In [17]:
imm_df = spark.read.format('com.github.saurfang.sas.spark').load('../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat')
print("Number of rows: ", imm_df.count())
imm_df.limit(5).toPandas()

Number of rows:  3096313

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,...,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,6.0,2016.0,4.0,692.0,692.0,XXX,20573.0,NaN,None,NaN,...,U,None,1979.0,10282016,None,None,None,1.897628e+09,None,B2
1,7.0,2016.0,4.0,254.0,276.0,ATL,20551.0,1.0,AL,NaN,...,Y,None,1991.0,D/S,M,None,None,3.736796e+09,00296,F1
2,15.0,2016.0,4.0,101.0,101.0,WAS,20545.0,1.0,MI,20691.0,...,None,M,1961.0,09302016,M,None,OS,6.666432e+08,93,B2
3,16.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,...,None,M,1988.0,09302016,None,None,AA,9.246846e+10,00199,B2
4,17.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,...,None,M,2012.0,09302016,None,None,AA,9.246846e+10,00199,B2

## US states

In [18]:
us_states_df = pd.read_html('https://www23.statcan.gc.ca/imdb/p3VD.pl?Function=getVD&TVD=53971')[0]
us_states_df = us_states_df.drop(columns=["Abbreviation", "Code"])
us_states_df = us_states_df.rename(columns={"State": "state", "Alpha code": "state_code"})
us_states_df = spark.createDataFrame(us_states_df)

print("Number of rows: ", us_states_df.count())
us_states_df.limit(5).toPandas()

Number of rows:  51

        state state_code
0     Alabama         AL
1      Alaska         AK
2     Arizona         AZ
3    Arkansas         AR
4  California         CA

## country codes

In [19]:
country_df = pd.read_html('https://countrycode.org/')[1]
country_df["ISO CODES"] = country_df["ISO CODES"].apply(lambda value: value.split(" / ")[0])
country_df.drop(columns=["COUNTRY CODE"], inplace=True)
country_df.rename(columns={"COUNTRY": "country", "ISO CODES": "country_code"}, inplace=True)
country_df = spark.createDataFrame(country_df)

print("Number of rows: ", country_df.count())
country_df.limit(5).toPandas()

Number of rows:  240

          country country_code
0     Afghanistan           AF
1         Albania           AL
2         Algeria           DZ
3  American Samoa           AS
4         Andorra           AD

## continent codes

In [20]:
continent_df = pd.read_html('https://www.php.net/manual/en/function.geoip-continent-code-by-name.php', keep_default_na=False)[0]
continent_df = spark.createDataFrame(continent_df)

print("Number of rows: ", continent_df.count())
continent_df.limit(5).toPandas()

Number of rows:  7

  Code Continent name
0   AF         Africa
1   AN     Antarctica
2   AS           Asia
3   EU         Europe
4   NA  North america

### Step 2: Explore and Assess the Data
#### Explore the Data 
Identify data quality issues, like missing values, duplicate data, etc.

#### Cleaning Steps
Document steps necessary to clean the data

In [21]:
# Performing cleaning tasks here
#print(temp_df.show())
dim_country_temperature_evolution_df = temperature_df.dropna()
dim_country_temperature_evolution_df = dim_country_temperature_evolution_df.withColumn("year", F.year("dt")).withColumn("month", F.month("dt"))
dim_country_temperature_evolution_df = dim_country_temperature_evolution_df.groupBy([F.col("Country").alias("country"), "year", "month"]).agg(
    F.avg("AverageTemperature").alias("average_temperature"),
    F.avg("AverageTemperatureUncertainty").alias("average_temperature_uncertainty"),
) 
dim_country_temperature_evolution_df = dim_country_temperature_evolution_df.withColumn('temperature_id', F.monotonically_increasing_id())

print("Number of rows: ", dim_country_temperature_evolution_df.count())
dim_country_temperature_evolution_df.printSchema()
dim_country_temperature_evolution_df.limit(5).toPandas()

Number of rows:  151549
root
 |-- country: string (nullable = true)
 |-- year: integer (nullable = true)
 |-- month: integer (nullable = true)
 |-- average_temperature: double (nullable = true)
 |-- average_temperature_uncertainty: double (nullable = true)
 |-- temperature_id: long (nullable = false)

,country,year,month,average_temperature,average_temperature_uncertainty,temperature_id
0,Denmark,1760,11,3.447,3.927,0
1,Denmark,1765,3,3.120,3.209,1
2,Denmark,1800,6,12.283,2.118,2
3,Denmark,1820,4,6.789,1.467,3
4,Denmark,1832,4,6.936,3.908,4

In [22]:
def get_no_of_chars(df_spark: DataFrame) -> pd.DataFrame:
    """Get the minimum and maximum number of characters per string type columns."""
    for column, dtype in df_spark.dtypes:
        if dtype == 'string':
            df_spark = df_spark.withColumn(f"len_{column}", F.length(column))

    min_list = [F.min(column) for column, dtype in df_spark.dtypes if "len_" in column]
    max_list = [F.max(column) for column, dtype in df_spark.dtypes if "len_" in column]
    no_chars_list = min_list + max_list
    return df_spark.select(no_chars_list).limit(len(no_chars_list)).toPandas().T

get_no_of_chars(dim_country_temperature_evolution_df)

                   0
min(len_country)   4
max(len_country)  20

In [27]:
#import capstone_project utils
from capstone_project.utils.process_data import extract_region
    
dim_world_airports_df = airport_df.where(F.col("type").isin(["small_airport", "medium_airport", "large_airport"]))
dim_world_airports_df = dim_world_airports_df.join(continent_df, F.col("continent") == continent_df.Code, how="left"). \
    join(country_df, F.col("iso_country") == country_df.country_code, how="left"). \
    join(us_states_df, extract_region(F.col("iso_region")) == us_states_df.state_code, how="left")

dim_world_airports_df = dim_world_airports_df.select(
    F.col("ident").alias("airport_id"),
    F.col("name").alias("airport_name"),
    F.split(F.col("type"),"_")[0].alias("airport_type"),
    F.col("iata_code"),
    F.col("local_code").alias("municipality_code"),
    F.col("municipality").alias("municipality"),
    extract_region(F.col("iso_region")).alias("region_code"),
    F.col("state").alias("region"),
    F.col("country_code"),
    F.col("country"),
    F.col("Code").alias("continent_code"),
    F.col("Continent name").alias("continent"),
    F.col("elevation_ft").cast(FloatType()),
    F.split(F.col("coordinates"), ", ")[1].cast(FloatType()).alias("latitude"),
    F.split(F.col("coordinates"), ", ")[0].cast(FloatType()).alias("longitude"),
)

print("Number of rows: ", dim_world_airports_df.count())
dim_world_airports_df.printSchema()
dim_world_airports_df.limit(5).toPandas()

Number of rows:  39142
root
 |-- airport_id: string (nullable = true)
 |-- airport_name: string (nullable = true)
 |-- airport_type: string (nullable = true)
 |-- iata_code: string (nullable = true)
 |-- municipality_code: string (nullable = true)
 |-- municipality: string (nullable = true)
 |-- region_code: string (nullable = true)
 |-- region: string (nullable = true)
 |-- country_code: string (nullable = true)
 |-- country: string (nullable = true)
 |-- continent_code: string (nullable = true)
 |-- continent: string (nullable = true)
 |-- elevation_ft: float (nullable = true)
 |-- latitude: float (nullable = true)
 |-- longitude: float (nullable = true)

,airport_id,airport_name,airport_type,iata_code,municipality_code,municipality,region_code,region,country_code,country,continent_code,continent,elevation_ft,latitude,longitude
0,DAUB,Biskra Airport,medium,BSK,None,Biskra,07,None,DZ,Algeria,AF,Africa,289.0,34.793301,5.738230
1,MM-0002,Hinthada Airport,small,HEB,None,Hinthada,07,None,MM,Myanmar,AS,Asia,32.0,17.633329,95.466698
2,MM-0004,Myoungmya Airport,small,None,None,Myoungmya,07,None,MM,Myanmar,AS,Asia,85.0,16.570999,94.932297
3,VYPN,Pathein Airport,small,BSX,None,Pathein,07,None,MM,Myanmar,AS,Asia,20.0,16.815201,94.779900
4,DIYO,Yamoussoukro Airport,medium,ASK,None,Yamoussoukro,07,None,CI,Ivory Coast,AF,Africa,699.0,6.903170,-5.365580

In [28]:
get_no_of_chars(dim_world_airports_df)

                             0
min(len_airport_id)          3
min(len_airport_name)        3
min(len_airport_type)        5
min(len_iata_code)           1
min(len_municipality_code)   1
min(len_municipality)        2
min(len_region_code)         1
min(len_region)              4
min(len_country_code)        2
min(len_country)             4
min(len_continent_code)      2
min(len_continent)           4
max(len_airport_id)          7
max(len_airport_name)       95
max(len_airport_type)        6
max(len_iata_code)           3
max(len_municipality_code)   7
max(len_municipality)       60
max(len_region_code)         4
max(len_region)             20
max(len_country_code)        2
max(len_country)            32
max(len_continent_code)      2
max(len_continent)          13

In [30]:
dim_us_states_df = us_states_df

print("Number of total rows: ", dim_us_states_df.count())
dim_us_states_df.printSchema()
dim_us_states_df.limit(5).toPandas()

Number of total rows:  51
root
 |-- state: string (nullable = true)
 |-- state_code: string (nullable = true)

        state state_code
0     Alabama         AL
1      Alaska         AK
2     Arizona         AZ
3    Arkansas         AR
4  California         CA

In [31]:
get_no_of_chars(dim_us_states_df)

                      0
min(len_state)        4
min(len_state_code)   2
max(len_state)       20
max(len_state_code)   2

In [34]:
from capstone_project.utils.read_data import read_i94_descr
#input_dir_path = "raw_data"

visa_category = read_i94_descr("I94VISA", input_dir)
dim_visa_df = imm_df.select(
    F.col("visatype").alias("visa_type"),
    F.col("visapost").alias("visa_issuer"),
    F.col("I94VISA").alias("visa_category_code").cast(IntegerType()).cast(StringType()),
).dropDuplicates()
dim_visa_df = dim_visa_df.withColumn("visa_category", F.col("visa_category_code")).replace(visa_category, subset="visa_category")

window_visa = Window.orderBy("visa_type")
dim_visa_df = dim_visa_df.withColumn("visa_id", F.row_number().over(window_visa))

print(dim_visa_df.count())
dim_visa_df.printSchema()
dim_visa_df.limit(5).toPandas()

Attribute description I94VISA was successfully read from I94_SAS_Labels_Descriptions.SAS.
2117
root
 |-- visa_type: string (nullable = true)
 |-- visa_issuer: string (nullable = true)
 |-- visa_category_code: string (nullable = true)
 |-- visa_category: string (nullable = true)
 |-- visa_id: integer (nullable = true)

  visa_type visa_issuer visa_category_code visa_category  visa_id
0        B1         VIL                  1      Business        1
1        B1         CDJ                  1      Business        2
2        B1         SDG                  1      Business        3
3        B1         VLL                  1      Business        4
4        B1         BOS                  1      Business        5

In [35]:
get_no_of_chars(dim_visa_df)

                             0
min(len_visa_type)           1
min(len_visa_issuer)         3
min(len_visa_category_code)  1
min(len_visa_category)       7
max(len_visa_type)           3
max(len_visa_issuer)         3
max(len_visa_category_code)  1
max(len_visa_category)       8

In [37]:
from capstone_project.utils.read_data import read_origin_countries

labels = ["origin_country_code", "origin_country"]
values = read_origin_countries(input_dir)
dim_applicant_origin_country = spark.createDataFrame(values, labels)

print(dim_applicant_origin_country.count())
dim_applicant_origin_country.printSchema()
dim_applicant_origin_country.limit(5).toPandas()

Attribute description i94res was successfully read from I94_SAS_Labels_Descriptions.SAS.
236
root
 |-- origin_country_code: string (nullable = true)
 |-- origin_country: string (nullable = true)

  origin_country_code origin_country
0                 582         MEXICO
1                 236    AFGHANISTAN
2                 101        ALBANIA
3                 316        ALGERIA
4                 102        ANDORRA

In [38]:
get_no_of_chars(dim_applicant_origin_country)

                               0
min(len_origin_country_code)   3
min(len_origin_country)        4
max(len_origin_country_code)   3
max(len_origin_country)       31

In [39]:
dim_status_flag = imm_df.select(
    F.col("entdepa").alias("arriaval_flag"),
    F.col("entdepd").alias("departure_flag"),
    F.col("entdepu").alias("update_flag"),
    F.col("matflag").alias("match_flag"),
).dropDuplicates()

window_arriaval = Window.orderBy("arriaval_flag")
dim_status_flag = dim_status_flag.withColumn("status_flag_id", F.row_number().over(window_arriaval))

print(dim_status_flag.count())
dim_status_flag.printSchema()
dim_status_flag.limit(5).toPandas()

125
root
 |-- arriaval_flag: string (nullable = true)
 |-- departure_flag: string (nullable = true)
 |-- update_flag: string (nullable = true)
 |-- match_flag: string (nullable = true)
 |-- status_flag_id: integer (nullable = true)

  arriaval_flag departure_flag update_flag match_flag  status_flag_id
0          None              R        None          M               1
1          None              I        None          M               2
2          None              O        None          M               3
3          None              K        None          M               4
4          None              J        None          M               5

In [41]:
labels = ["admission_port_code", "admission_port"]
values = read_i94_descr("i94port", input_dir, clean_descr=True).items()
dim_admission_port = spark.createDataFrame(values, labels)

print(dim_admission_port.count())
dim_admission_port.printSchema()
dim_admission_port.limit(5).toPandas()

Attribute description i94port was successfully read from I94_SAS_Labels_Descriptions.SAS.
587
root
 |-- admission_port_code: string (nullable = true)
 |-- admission_port: string (nullable = true)

  admission_port_code                admission_port
0                 ALC                     ALCAN, AK
1                 ANC                 ANCHORAGE, AK
2                 BAR  BAKER AAF - BAKER ISLAND, AK
3                 DAC             DALTONS CACHE, AK
4                 PIZ    DEW STATION PT LAY DEW, AK

In [42]:
get_no_of_chars(dim_admission_port)

                               0
min(len_admission_port_code)   3
min(len_admission_port)        3
max(len_admission_port_code)   3
max(len_admission_port)       38

In [43]:
mode = read_i94_descr("i94mode", input_dir)
dim_arriaval_mode = imm_df.select(
    F.col("i94mode").alias("mode_code").cast(IntegerType()).cast(StringType()),
    F.col("airline"),
    F.col("fltno").alias("flight_number"),
).dropDuplicates()
dim_arriaval_mode = dim_arriaval_mode.withColumn("mode", F.col("mode_code")).replace(mode, subset="mode")

window_arriaval_mode = Window.orderBy("mode_code")
dim_arriaval_mode = dim_arriaval_mode.withColumn("arriaval_mode_id", F.row_number().over(window_arriaval_mode))

print(dim_arriaval_mode.count())
dim_arriaval_mode.printSchema()
dim_arriaval_mode.limit(5).toPandas()

Attribute description i94mode was successfully read from I94_SAS_Labels_Descriptions.SAS.
12020
root
 |-- mode_code: string (nullable = true)
 |-- airline: string (nullable = true)
 |-- flight_number: string (nullable = true)
 |-- mode: string (nullable = true)
 |-- arriaval_mode_id: integer (nullable = true)

  mode_code airline flight_number  mode  arriaval_mode_id
0      None    None          None  None                 1
1         1      RS         07665   Air                 2
2         1      LH         00412   Air                 3
3         1      DY          7067   Air                 4
4         1      3M         00108   Air                 5

In [44]:
@F.udf(returnType=DateType())
def convert_to_datetime(date: F.col) -> StringType:
    """Convert timestamp to yyyy-mm-dd format."""
    if date is not None:
        return pd.Timestamp("1960-1-1") + pd.to_timedelta(date, unit="D")

admission_date_df = imm_df.select(F.to_date(F.col("dtaddto"),"MMddyyyy").alias("date")).distinct()
added_file_date_df = imm_df.select(F.to_date(F.col("dtadfile"), "yyyyMMdd")).distinct()
arrival_date_df = imm_df.select(convert_to_datetime(F.col("arrdate"))).distinct()
departure_date_df = imm_df.select(convert_to_datetime(F.col("depdate"))).distinct()

date_df = (
        admission_date_df.union(admission_date_df)
        .union(added_file_date_df)
        .union(arrival_date_df)
        .union(departure_date_df)
        .distinct()
    )

date_df = date_df.select(
    F.col("date"),
    F.year(F.col("date")).alias("year"),
    F.quarter(F.col("date")).alias("quarter"),
    F.month(F.col("date")).alias("month"),
    F.weekofyear(F.col("date")).alias("week_of_year"),
    F.dayofweek(F.col("date")).alias("day_of_week"),
    F.dayofmonth(F.col("date")).alias("day_of_month"),
    F.dayofyear(F.col("date")).alias("day_of_year"),
).na.drop(subset=["date"])

print(date_df.count())
date_df.printSchema()
date_df.limit(5).toPandas()

836
root
 |-- date: date (nullable = true)
 |-- year: integer (nullable = true)
 |-- quarter: integer (nullable = true)
 |-- month: integer (nullable = true)
 |-- week_of_year: integer (nullable = true)
 |-- day_of_week: integer (nullable = true)
 |-- day_of_month: integer (nullable = true)
 |-- day_of_year: integer (nullable = true)

,date,year,quarter,month,week_of_year,day_of_week,day_of_month,day_of_year
0,2017-09-11,2017,3,9,37,2,11,254
1,2017-08-11,2017,3,8,32,6,11,223
2,2016-03-01,2016,1,3,9,3,1,61
3,2016-04-25,2016,2,4,17,2,25,116
4,2018-03-17,2018,1,3,11,7,17,76

In [45]:
fact_immigrant_application = imm_df.join(
    F.broadcast(dim_visa_df),
    (imm_df.visatype == dim_visa_df.visa_type)
    & (imm_df.i94visa == dim_visa_df.visa_category_code)
    & (imm_df.visapost == dim_visa_df.visa_issuer),
    how='left'
).join(
    F.broadcast(dim_status_flag),
    (imm_df.entdepa == dim_status_flag.arriaval_flag)
    & (imm_df.entdepd == dim_status_flag.departure_flag)
    & (imm_df.entdepu == dim_status_flag.update_flag)
    & (imm_df.matflag == dim_status_flag.match_flag),
    how='left'
).join(
    dim_arriaval_mode,
    (imm_df.i94mode == dim_arriaval_mode.mode_code)
    & (imm_df.airline == dim_arriaval_mode.airline)
    & (imm_df.fltno == dim_arriaval_mode.flight_number),
    how='left'
)

fact_immigrant_application = fact_immigrant_application.select(
    F.col("cicid").alias("file_id").cast(IntegerType()),
    F.col("insnum").alias("ins_number").cast(IntegerType()),
    F.col("admnum").alias("admission_number").cast(IntegerType()),
    F.col("i94bir").alias("applicant_age").cast(IntegerType()),
    F.col("biryear").alias("applicant_birth_year").cast(IntegerType()),
    F.col("gender"),
    F.col("occup").alias("occupation"),
    F.col("visa_id"),
    F.to_date(F.col("dtadfile"), "yyyyMMdd").alias("application_date"),
    F.col("i94port").alias("admission_port_code"),
    F.col("i94addr").alias("arriaval_state_code"),
    F.col("arriaval_mode_id"),
    convert_to_datetime(F.col("arrdate")).alias("arriaval_date"),
    convert_to_datetime(F.col("depdate")).alias("departure_date"),
    F.to_date(F.col("dtaddto"),"MMddyyyy").alias("limit_date"),
    F.col("status_flag_id"),
    F.col("i94cit").alias("birth_country").cast(IntegerType()).cast(StringType()),
    F.col("i94res").alias("residence_country").cast(IntegerType()).cast(StringType())
)

print(fact_immigrant_application.count())
fact_immigrant_application.printSchema()
fact_immigrant_application.limit(5).toPandas()

3096313
root
 |-- file_id: integer (nullable = true)
 |-- ins_number: integer (nullable = true)
 |-- admission_number: integer (nullable = true)
 |-- applicant_age: integer (nullable = true)
 |-- applicant_birth_year: integer (nullable = true)
 |-- gender: string (nullable = true)
 |-- occupation: string (nullable = true)
 |-- visa_id: integer (nullable = true)
 |-- application_date: date (nullable = true)
 |-- admission_port_code: string (nullable = true)
 |-- arriaval_state_code: string (nullable = true)
 |-- arriaval_mode_id: integer (nullable = true)
 |-- arriaval_date: date (nullable = true)
 |-- departure_date: date (nullable = true)
 |-- limit_date: date (nullable = true)
 |-- status_flag_id: integer (nullable = true)
 |-- birth_country: string (nullable = true)
 |-- residence_country: string (nullable = true)

,file_id,ins_number,admission_number,applicant_age,applicant_birth_year,gender,occupation,visa_id,application_date,admission_port_code,arriaval_state_code,arriaval_mode_id,arriaval_date,departure_date,limit_date,status_flag_id,birth_country,residence_country
0,5915334,5055.0,2147483647,92,1924,M,None,422.0,2016-05-10,SDP,CA,NaN,2016-04-23,None,2016-10-21,None,687,687
1,4503220,NaN,2147483647,37,1979,M,None,NaN,2016-04-24,FTL,None,4661.0,2016-04-24,2016-04-27,2016-07-22,None,135,135
2,311835,NaN,2147483647,33,1983,M,None,10.0,2016-04-02,OPF,None,1749.0,2016-04-02,2016-04-06,2016-10-01,None,512,512
3,3189001,NaN,2147483647,33,1983,M,None,391.0,2016-04-17,OPF,None,1749.0,2016-04-17,2016-04-22,2016-10-16,None,512,512
4,4119775,NaN,2147483647,38,1978,M,None,10.0,2016-04-22,LVG,None,1749.0,2016-04-22,2016-04-25,2016-10-21,None,512,512

## Average immigrates by state

In [49]:
# Extract the year from the 'arriaval_date' column
fact_immigrant_application = fact_immigrant_application.withColumn("year", F.year("arriaval_date"))

# Grouping by state and year to calculate the number of immigrants for each state and year
immigrants_by_state_year = fact_immigrant_application.groupBy("arriaval_state_code", "year").count()

# Calculate the total number of immigrants for each state across all years
total_immigrants_by_state = immigrants_by_state_year.groupBy("arriaval_state_code").agg(F.sum("count").alias("total_immigrants"))

# Calculate the average number of immigrants for each state
total_years = fact_immigrant_application.select("year").distinct().count()
average_immigrants_by_state = total_immigrants_by_state.withColumn("average_immigrants", F.col("total_immigrants") / F.lit(total_years))

# Sort the result based on the state with the highest average immigrants
sorted_average_immigrants = average_immigrants_by_state.orderBy(F.desc("average_immigrants"))

# Show the result
sorted_average_immigrants.show()

+-------------------+----------------+------------------+
|arriaval_state_code|total_immigrants|average_immigrants|
+-------------------+----------------+------------------+
|                 FL|          621701|          621701.0|
|                 NY|          553677|          553677.0|
|                 CA|          470386|          470386.0|
|                 HI|          168764|          168764.0|
|               null|          152592|          152592.0|
|                 TX|          134321|          134321.0|
|                 NV|          114609|          114609.0|
|                 GU|           94107|           94107.0|
|                 IL|           82126|           82126.0|
|                 NJ|           76531|           76531.0|
|                 MA|           70486|           70486.0|
|                 WA|           55792|           55792.0|
|                 GA|           44663|           44663.0|
|                 MI|           32101|           32101.0|
|                 VA|           31399|           31399.0|
|                 PA|           30293|           30293.0|
|                 DC|           28228|           28228.0|
|                 NE|           26574|           26574.0|
|                 MD|           25360|           25360.0|
|                 NC|           23375|           23375.0|
+-------------------+----------------+------------------+
only showing top 20 rows

### Step 3: Define the Data Model
#### 3.1 Conceptual Data Model
Map out the conceptual data model and explain why you chose that model

#### 3.2 Mapping Out Data Pipelines
List the steps necessary to pipeline the data into the chosen data model

### Step 4: Run Pipelines to Model the Data 
#### 4.1 Create the data model
Build the data pipelines to create the data model.

#### 4.2 Data Quality Checks
Explain the data quality checks you'll perform to ensure the pipeline ran as expected. These could include:
 * Integrity constraints on the relational database (e.g., unique key, data type, etc.)
 * Unit tests for the scripts to ensure they are doing the right thing
 * Source/Count checks to ensure completeness
 
Run Quality Checks

#### 4.3 Data dictionary 
Create a data dictionary for your data model. For each field, provide a brief description of what the data is and where it came from. You can include the data dictionary in the notebook or in a separate file.

#### Step 5: Complete Project Write Up
* Clearly state the rationale for the choice of tools and technologies for the project.
* Propose how often the data should be updated and why.
* Write a description of how you would approach the problem differently under the following scenarios:
 * The data was increased by 100x.
 * The data populates a dashboard that must be updated on a daily basis by 7am every day.
 * The database needed to be accessed by 100+ people.

In [45]:
import boto3

# Create an S3 client
s3 = boto3.client('s3')

# Specify your AWS access key and secret access key
access_key = ''
secret_key = ''

# Set the credentials for the S3 client
s3 = boto3.client('s3', aws_access_key_id=access_key, aws_secret_access_key=secret_key)

In [46]:
import boto3
import os

def upload_parquet_files_to_s3(local_directory, s3_bucket):

    access_key = ''
    secret_key = ''

    s3 = boto3.client(
    's3',
    aws_access_key_id=access_key,
    aws_secret_access_key=secret_key
    )
    
    for root, dirs, files in os.walk(local_directory):
        for file in files:
            if file.endswith('.parquet'):
                local_path = os.path.join(root, file)
                s3_path = os.path.join(s3_bucket, file)
                s3.upload_file(local_path, s3_bucket, s3_path)
                print(f"Uploaded {local_path} to S3 bucket {s3_bucket} at {s3_path}")

# Usage example
local_directory = 'path_to_save_parquet_file.parquet'
s3_bucket = 'capstoneglobaltemp'

upload_parquet_files_to_s3(local_directory, s3_bucket)